#define NO_AUX_NOUN 52
//unsigned char *aux_noun[]=
char *aux_noun[]=
{
	"것",					  // 0-8 까지 관형사, 의, 는, (으)ㄴ, (으)ㄹ 뒤에
	"따위",
	"분",
	"이",
	"자",
	"쪽",
	"지경",
	"축",
	"치",
	"노릇",					  //9 9-20 까지, 는, (으)ㄴ (으)ㄹ 뒤에
	"수",
	"대로",
	"데",
	"둥",
	"듯",
	"만큼",
	"바",
	"양",
	"적",
	"줄",
	"터",
	"김",					  // 21-23 까지 는, (으)ㄹ 뒤에
	"때문",
	"체",
	"등",					  // 24-28 까지 는 뒤에
	"말",
	"바람",
	"통",
	"품",
	"깐",					  // 29-31 까지 (으)ㄴ 뒤에
	"지",
	"채",
	"폭",
	"나름",					  // 33-48 까지 (으)ㄹ 뒤에
	"나위",
	"녘",
	"따름",
	"리",
	"만무",
	"무렵",
	"뻔",
	"법",
	"뿐",
	"상",					  //39
	"섟",
	"짝",
	"즈음",
	"참",
	"턱",
	"딴",					  // 49-52 까지 관형사, 의 뒤에
	"등지",
	"해"
};
int aux_noun_index[]=
{
	0,
	0,0,0,0,0,  0,0,0,1,1,
	1,1,1,1,1,  1,1,1,1,1,
	2,2,2,3,3,  3,3,3,4,4,
	4,5,5,5,5,  5,5,5,5,5,
	5,5,5,5,5,  5,5,5,6,6,
	6
};
char *aux_noun_prev_type0[]=
//unsigned char *aux_noun_prev_type0[]=
{
	"의","는","은","ㄴ","을","ㄹ"
};

char *aux_noun_prev_type1[]=
//unsigned char *aux_noun_prev_type1[]=
{
	"는","을","ㄹ","은","ㄴ"
};
char *aux_noun_prev_type2[]=
{
	"는","은","ㄴ"
};
char *aux_noun_prev_type3[]=
{
	"는"
};
char *aux_noun_prev_type4[]=
{
	"은","ㄴ"
};
char *aux_noun_prev_type5[]=
{
	"을","ㄹ"
};
char *aux_noun_prev_type6[]=
{
	"의"
};
int no_aux_noun_type[]={6,5,3,1,2,2,1};
//unsigned char **aux_noun_prev[7];
char **aux_noun_prev[7];

int  aux_noun_josa_flag[]=
{
	1,						  // "것",
	1,						  //"따위",
	1,						  //"분",
	1,						  //"이",
	1,						  //"자",
	1,						  //"쪽",
	3,						  //"지경",
	1,						  //"축",
	0,						  //"치",
	3,						  //"노릇",
	7,						  //"대로",
	1,						  //"데",
	4,						  //"등",
	7,						  //"듯",
	7,						  //"만큼",
	1,						  //"바",
	4,						  //"양",
	0,						  //"적",
	4,						  //"줄",
	3,						  //"터",
	6,						  //"김",
	3,						  //"때문",
	4,						  //"체",
	1,						  //"등",
	0,						  //"말",
	6,						  //"바람",
	6,						  //"통",
	0,						  //"품",
	0,						  //"깐",
	2,						  //"지",
	5,						  //"채",
	3,						  //"폭",
	3,						  //"나름",
	2,						  //"나위",
	1,						  //"녘",
	3,						  //"따름",
	2,						  //"리",
	0,						  //"만무",
	1,						  //"무렵",
	7,						  //"뻔",
	7,						  //"법",
	3,						  //"뿐",
	7,						  //"상",
	6,						  //"섟",
	2,						  //"수",
	6,						  //"짝",
	1,						  //"즈음",
	3,						  //"참",
	2,						  //"턱",
	6,						  //"딴",
	1,						  //"등지",
	3,						  //"해"
};
