1;

# 예외적인 경우를 처리.
sub rule_ex
{

#초성
#1  2  3  4  5  6  7  8  9  10 11 12 13 14 15 16 17 18 19
#ㄱ ㄲ ㄴ ㄷ ㄸ ㄹ ㅁ ㅂ ㅃ ㅅ ㅆ ㅇ ㅈ ㅉ ㅊ ㅋ ㅌ ㅍ ㅎ

#중성
# 1  2  3  4  5  6  7  8  9  10 11 12 13 14 15 16 17 18 19 20 21
# ㅏ ㅐ ㅑ ㅒ ㅓ ㅔ ㅕ ㅖ ㅗ ㅘ ㅙ ㅚ ㅛ ㅜ ㅝ ㅞ ㅟ ㅠ ㅡ ㅢ ㅣ

#종성
#1  2  3  4  5  6  7  8  9  10 11 12 13 14 15 16 17 18 19 20 21 22 23
#ㄱ ㄲ ㄳ ㄴ ㄵ ㄶ ㄷ ㄹ ㄺ ㄻ ㄼ ㄽ ㄾ ㄿ ㅀ ㅁ ㅂ ㅄ ㅅ ㅆ ㅇ ㅈ ㅊ 
#24 25 26 27
#ㅋ ㅌ ㅍ ㅎ

	$_=join(' ',@_);

#밟- 넓- 처리. - 제11항 예외
	s/(i08j01)k11(i[02][1-9]|i1[13456789])/\1k17\2/g; #밟- 다음 자음이면 밥
	s/(i03j05)k11(i13j14k01)/\1k17\2/g; #넓죽-
	s/(i03j05)k11(i04j14k21)/\1k17\2/g; #넓둥-

# rule 17 붙임
	s/k07i19j21/k00i15j21/g; # 굳히다 -> 구치다

#제12항 1  처리
	s/k27i01/k00i16/g; #ㅎ ㄱ -> ㅋ
	s/k27i04/k00i17/g; #ㅎ ㄷ -> ㅌ
	s/k27i13/k00i15/g; #ㅎ ㅈ -> ㅊ

	s/k06i01/k04i16/g; #ㄴㅎ ㄱ -> ㄴㅋ
	s/k06i04/k04i17/g; #ㄴㅎ ㄷ -> ㄴㅌ
	s/k06i13/k04i15/g; #ㄴㅎ ㅈ -> ㄴㅊ

	s/k15i01/k08i16/g; #ㄹㅎ ㄱ -> ㄹㅋ
	s/k15i04/k08i17/g; #ㄹㅎ ㄷ -> ㄹㅌ
	s/k15i13/k08i15/g; #ㄹㅎ ㅈ -> ㄹㅊ

#제12항 1의 붙임 1
	s/k01i19/k00i16/g; #ㄱㅎ -> ㅋ
	s/k09i19/k06i16/g; #ㄺㅎ -> ㄹㅋ
	s/k07i19/k00i17/g; #ㄷㅎ -> ㅌ
	s/k17i19/k00i18/g; #ㅂㅎ -> ㅍ
	s/k11i19/k08i18/g; #ㄼㅎ -> ㄹㅍ
	s/k22i19/k00i15/g; #ㅈㅎ -> ㅊ
	s/k05i19/k04i15/g; #ㄵㅎ -> ㄴㅊ

#제12항 1의 붙임 1
	s/k19i19/k00i17/g; #ㅅㅎ -> ㅌ
	s/k23i19/k00i17/g; #ㅊㅎ -> ㅌ
	s/k27i19/k00i17/g; #ㅌㅎ -> ㅌ

#제12항 2  처리
	s/k27i10/k00i11/g; #ㅎ ㅅ -> ㅆ
	s/k06i10/k04i11/g; #ㄴㅎ ㅅ -> ㄴㅆ
	s/k15i10/k08i11/g; #ㄹㅎ ㅅ -> ㄹㅆ

#제12항 3  처리
	s/k27i03/k04i03/g; #ㅎ ㄴ -> ㄴㄴ
	s/k06i03/k04i03/g; #ㄴㅎ ㄴ -> ㄴㄴ
	s/k15i03/k08i03/g; #ㄹㅎ ㄴ -> ㄹㄴ

#제16항
	s/(i04j21k00i01j19)k07i12/\1k00i10/g; #디귿ㅇ 디그ㅅ
	s/(i13j21k00i12j19)k22i12/\1k00i10/g; #지읒ㅇ 지으ㅅ
	s/(i15j21k00i12j19)k23i12/\1k00i10/g; #치읓ㅇ 치으ㅅ
	s/(i16j21k00i12j19)k24i12/\1k00i01/g; #키읔ㅇ 키으ㄱ
	s/(i17j21k00i12j19)k25i12/\1k00i10/g; #티읕ㅇ 티으ㅅ
	s/(i18j21k00i12j19)k26i12/\1k00i10/g; #피읖ㅇ 피으ㅅ
	s/(i19j21k00i12j19)k27i12/\1k00i10/g; #히읗ㅇ 히으ㅅ

	return $_;
};

# 단어의 하이픈화를 처리..
sub rule_hyphen
{
	my($input, $mode) = @_;

	$_ = $input;

	#행정구역의 hyphen
	if ($mode == 3)
	{
		s/i04j09k00$/i99j99k99i04j09k00/g; #도
		s/i10j21k00$/i99j99k99i10j21k00/g; #시
		s/i01j14k04$/i99j99k99i01j14k04/g; #군
		s/i01j14k00$/i99j99k99i01j14k00/g; #구
		s/i12j19k17$/i99j99k99i12j19k17/g; #읍
		s/i07j07k04$/i99j99k99i07j07k04/g; #면
		s/i06j21k00$/i99j99k99i06j21k00/g; #리
		s/i04j09k21$/i99j99k99i04j09k21/g; #동
		s/i01j01k00$/i99j99k99i01j01k00/g; #가
	}
	# 인명모드일 경우 글자사이에 hyphen을 넣어준다.
	elsif ($mode == 2)
	{
		s/(k[0-2]\d)(i[0-2]\d)/\1i99j99k99\2/g;
	}

	# 일반적인 예외들...예외가 일반적... 어폐다..
	s/k21i12/k21i99j99k99i12/g; # ㅇㅇ
	s/k04i01/k04i99j99k99i01/g; # ㄴㄱ

	# 모음의 모호성에의한 hyphen
	s/((j06|j08)k00)(i12j09)/\1i99j99k99\3/g; #ㅔ,ㅖ + ㅗ --- ㅓ, ㅕ
	s/(j06k00)(i12j14)/\1i99j99k99\2/g; #ㅔ + ㅜ --- ㅡ
	s/((j01|j03|j09|j10)k00)(i12j06)/\1i99j99k99\3/g; #ㅏ,ㅑ,ㅘ + ㅔ --- ㅐ,ㅒ,ㅚ,ㅙ
	s/(j02k00)(i12j14)/\1i99j99k99\2/g; # ㅐ + ㅜ --- ㅏ + ㅡ
	s/(j01k00)(i12j19)/\1i99j99k99\2/g; # ㅏ + ㅡ --- ㅐ + ㅜ
	s/(j14k00)(i12j21)/\1i99j99k99\2/g; # ㅜ + ㅣ --- ㅢ

	# 중복된 hyphen의 제거
	s/i99j99k99i99j99k99/i99j99k99/g;

	return $_;
};
